ogneyar/ArduinoProjects/Libraries/Миландр. Standard Peripherals Library/Libraries/SPL/MDR32FxQI/inc/MDR32FxQI_adc.h
#define IS_ADC_INT_VREF_SOURCE_CONFIG(CONFIG) (((CONFIG) == ADC_INT_VREF_SOURCE_INEXACT) || \
                                               ((CONFIG) == ADC_INT_VREF_SOURCE_EXACT  ))

/**
  * @brief ADC Clock Prescaler
  */
typedef enum
{
    ADC_CLK_div_None = (((uint32_t)0x0) << ADC1_CFG_REG_DIVCLK_Pos), /*!< The input ADC clock devides by 1. */
    ADC_CLK_div_2    = (((uint32_t)0x1) << ADC1_CFG_REG_DIVCLK_Pos), /*!< The input ADC clock devides by 2. */
    ADC_CLK_div_4    = (((uint32_t)0x2) << ADC1_CFG_REG_DIVCLK_Pos), /*!< The input ADC clock devides by 4. */
    ADC_CLK_div_8    = (((uint32_t)0x3) << ADC1_CFG_REG_DIVCLK_Pos), /*!< The input ADC clock devides by 8. */
    ADC_CLK_div_16   = (((uint32_t)0x4) << ADC1_CFG_REG_DIVCLK_Pos), /*!< The input ADC clock devides by 16. */
    ADC_CLK_div_32   = (((uint32_t)0x5) << ADC1_CFG_REG_DIVCLK_Pos), /*!< The input ADC clock devides by 32. */
    ADC_CLK_div_64   = (((uint32_t)0x6) << ADC1_CFG_REG_DIVCLK_Pos), /*!< The input ADC clock devides by 64. */
    ADC_CLK_div_128  = (((uint32_t)0x7) << ADC1_CFG_REG_DIVCLK_Pos), /*!< The input ADC clock devides by 128. */
    ADC_CLK_div_256  = (((uint32_t)0x8) << ADC1_CFG_REG_DIVCLK_Pos), /*!< The input ADC clock devides by 256. */
    ADC_CLK_div_512  = (((uint32_t)0x9) << ADC1_CFG_REG_DIVCLK_Pos), /*!< The input ADC clock devides by 512. */
    ADC_CLK_div_1024 = (((uint32_t)0xA) << ADC1_CFG_REG_DIVCLK_Pos), /*!< The input ADC clock devides by 1024.*/
    ADC_CLK_div_2048 = (((uint32_t)0xB) << ADC1_CFG_REG_DIVCLK_Pos)  /*!< The input ADC clock devides by 2048. */
} ADCx_Prescaler;

#define IS_ADC_CLK_div_VALUE(VALUE) (((VALUE) == ADC_CLK_div_None) || \
                                     ((VALUE) == ADC_CLK_div_2   ) || \
                                     ((VALUE) == ADC_CLK_div_4   ) || \
                                     ((VALUE) == ADC_CLK_div_8   ) || \
                                     ((VALUE) == ADC_CLK_div_16  ) || \
                                     ((VALUE) == ADC_CLK_div_32  ) || \
                                     ((VALUE) == ADC_CLK_div_64  ) || \
                                     ((VALUE) == ADC_CLK_div_128 ) || \
                                     ((VALUE) == ADC_CLK_div_256 ) || \
                                     ((VALUE) == ADC_CLK_div_512 ) || \
                                     ((VALUE) == ADC_CLK_div_1024) || \
                                     ((VALUE) == ADC_CLK_div_2048))

/**
  * @brief ADCx Flags
  */
typedef enum
{
    ADCx_FLAG_OVERWRITE         = (((uint32_t)0x1) << ADC_STATUS_FLG_REG_OVERWRITE_Pos),
    ADCx_FLAG_OUT_OF_RANGE      = (((uint32_t)0x1) << ADC_STATUS_FLG_REG_AWOIFEN_Pos),
    ADCx_FLAG_END_OF_CONVERSION = (((uint32_t)0x1) << ADC_STATUS_FLG_REG_EOCIF_Pos)
} ADCx_Flags;

#define IS_ADCx_STATUS_FLAG(FLAG) (((FLAG) == ADCx_FLAG_OVERWRITE)    || \
                                   ((FLAG) == ADCx_FLAG_OUT_OF_RANGE) || \
                                   ((FLAG) == ADCx_FLAG_END_OF_CONVERSION))

/**
  * @brief ADC Flags
  */
typedef enum
{
    ADC1_FLAG_OVERWRITE         = (ADCx_FLAG_OVERWRITE         <<  0),
    ADC1_FLAG_OUT_OF_RANGE      = (ADCx_FLAG_OUT_OF_RANGE      <<  0),
    ADC1_FLAG_END_OF_CONVERSION = (ADCx_FLAG_END_OF_CONVERSION <<  0),
#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
    ADC2_FLAG_OVERWRITE         = (ADCx_FLAG_OVERWRITE         << 16),
    ADC2_FLAG_OUT_OF_RANGE      = (ADCx_FLAG_OUT_OF_RANGE      << 16),
    ADC2_FLAG_END_OF_CONVERSION = (ADCx_FLAG_END_OF_CONVERSION << 16)
#endif
} ADC_Flags;

#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
    #define IS_ADC_STATUS_FLAG(FLAG) (((FLAG) == ADC1_FLAG_OVERWRITE        ) || \
                                      ((FLAG) == ADC1_FLAG_OUT_OF_RANGE     ) || \
                                      ((FLAG) == ADC1_FLAG_END_OF_CONVERSION) || \
                                      ((FLAG) == ADC2_FLAG_OVERWRITE        ) || \
                                      ((FLAG) == ADC2_FLAG_OUT_OF_RANGE     ) || \
                                      ((FLAG) == ADC2_FLAG_END_OF_CONVERSION))
#endif /* #if defined  (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI) */

#if defined (USE_MDR32F1QI)
    #define IS_ADC_STATUS_FLAG(FLAG) (((FLAG) == ADC1_FLAG_OVERWRITE        ) || \
                                      ((FLAG) == ADC1_FLAG_OUT_OF_RANGE     ) || \
                                      ((FLAG) == ADC1_FLAG_END_OF_CONVERSION))
#endif /* #if defined (USE_MDR32F1QI) */

/**
  * @brief ADCx Interrupt definition
  */
typedef enum
{
    ADCx_IT_OUT_OF_RANGE      = (((uint32_t)0x1) << ADC_STATUS_FLG_REG_AWOIFEN_Pos),
    ADCx_IT_END_OF_CONVERSION = (((uint32_t)0x1) << ADC_STATUS_FLG_REG_EOCIF_Pos)
} ADCx_IT_Def;

#define IS_ADCx_CONFIG_IT(IT)           (((IT) == ADCx_IT_OUT_OF_RANGE) || \
                                         ((IT) == ADCx_IT_END_OF_CONVERSION))

/**
  * @brief ADC Interrupt definition
  */
typedef enum
{
    ADC1_IT_OUT_OF_RANGE      = (ADCx_IT_OUT_OF_RANGE      <<  0),
    ADC1_IT_END_OF_CONVERSION = (ADCx_IT_END_OF_CONVERSION <<  0),
#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
    ADC2_IT_OUT_OF_RANGE      = (ADCx_IT_OUT_OF_RANGE      << 16),
    ADC2_IT_END_OF_CONVERSION = (ADCx_IT_END_OF_CONVERSION << 16)
#endif
} ADC_IT_Def;

#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
    #define IS_ADC_CONFIG_IT(IT)              (((IT) == ADC1_IT_OUT_OF_RANGE     ) || \
                                               ((IT) == ADC1_IT_END_OF_CONVERSION) || \
                                               ((IT) == ADC2_IT_OUT_OF_RANGE     ) || \
                                               ((IT) == ADC2_IT_END_OF_CONVERSION))
#endif /* #if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI) */

#if defined (USE_MDR32F1QI)
    #define IS_ADC_CONFIG_IT(IT)              (((IT) == ADC1_IT_OUT_OF_RANGE     ) || \
                                               ((IT) == ADC1_IT_END_OF_CONVERSION))
#endif /* #if defined (USE_MDR32F1QI) */


#if defined (USE_MDR32F1QI)

/**
  * @brief ADC Int_VRef Amplifier state
  */
typedef enum
{
    ADC_INT_VREF_AMPLIFIER_Enable  = ((uint32_t)(1 << ADC1_TRIM_SEL_VREF_BUF_Pos)),
    ADC_INT_VREF_AMPLIFIER_Disable = ((uint32_t)(0 << ADC1_TRIM_SEL_VREF_BUF_Pos))
} ADC_Int_VRef_Ampl_State;

#define IS_ADC_INT_VREF_AMPLIFIER(AMPLIFIER)    (((AMPLIFIER) == ADC_INT_VREF_AMPLIFIER_Enable) ||\
                                                 ((AMPLIFIER) == ADC_INT_VREF_AMPLIFIER_Disable))

#endif /* #if defined (USE_MDR32F1QI) */

/**
  * @brief ADC Init structure definition
  */
typedef struct {
#if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI)
    ADC_SyncMode               ADC_SynchronousMode;      /*!< Enables or disables the ADC1, ADC2 synchronous mode operation.
                                                              This parameter can be a value of @ref ADC_SyncMode */
    uint32_t                   ADC_StartDelay;           /*!< Specifies the ADC1 and ADC2 conversion start delay.
                                                              This parameter can be a number between 0 and 15. */
#endif /* #if defined (USE_MDR32F9Q2I) || defined (USE_MDR32FG16S1QI) */
    ADC_Temp_Sensor            ADC_TempSensor;           /*!< Enables or disables the temperature sensor and internal voltage reference.
                                                              This parameter can be a value of @ref ADC_Temp_Sensor */
    ADC_Temp_Sensor_Amplifier  ADC_TempSensorAmplifier;  /*!< Enables or disables the temperature sensor and internal voltage reference amplifier.
                                                              This parameter can be a value of @ref ADC_Temp_Sensor_Amplifier */
    ADC_Temp_Sensor_Conversion ADC_TempSensorConversion; /*!< Enables or disables the temperature sensor conversion.
                                                              This parameter can be a value of @ref ADC_Temp_Sensor_Conversion */
    ADC_Int_VRef_Conversion    ADC_IntVRefConversion;    /*!< Enables or disables the internal voltage reference conversion.
                                                              This parameter can be a value of @ref ADC_Int_VRef_Conversion */
    uint32_t                   ADC_IntVRefTrimming;      /*!< Configures the internal voltage reference trimming. @ref ADC_Int_VRef_Trimming
                                                              This parameter can be a number between 0 and 7 for MDR32F9Q2I and MDR32FG16S1QI;
                                                                                and a number between 0 and 31 for MDR32F1QI */
#if defined (USE_MDR32F1QI)
    ADC_Int_VRef_Ampl_State    ADC_IntVRefAmplifier;     /*!< Enable or disable the internal voltage reference amplifier.
                                                              This parameter can be a value of @ref ADC_Int_VRef_Ampl_State */
#endif /* #if defined (USE_MDR32F1QI) */
} ADC_InitTypeDef;

/**
  * @brief  ADC1, ADC2 Init structure definition
  */
typedef struct
{
    ADCx_Clock_Source      ADC_ClockSource;      /*!< Specifies the ADCx clock source.
                                                      This parameter can be a value of @ref ADCx_Clock_Source */

